
public class ch06_14_Method {

	public static void main(String[] args) {
		
//		메서드란? 문장들을 묶어놓은 것.
//		메서드는 클래스 안에 있어야 함.
//		메서드의 장점 1. 코드의 중복을 중일 수 있다. 2. 코드의 관리가 쉽다 3. 코드를 재사용 할 수 있다. 4. 코드가 간결해서 이해가 쉬워진다.
		
		// 메서드는 한 가지 기능만 수행하도록 작성하는게 좋다. 그래야 재사용성이 높아짐.
		
//		메서드 = 선언부 + 구현부
		
//		반환타입 메서드이름 (타입 변수명, 타입 변수명, .. 입력은 0~n개까지 가능) 선언부
//		{
//				메서드 호출시 수행될 코드				구현부
//		}		출력값은 0 ~ 1개(작업결과가 여러개일시 배열로 묶거나 객체에 담아야 한다)
		
		
		
		
		// 지역변수 : 메서드 내에 선언된 변수(메서드 안에서만 쓰기때문에 이름이 겹쳐도 상관X 매개변수도 지역변수.)
//		int add (int x/*매개변수*/, int y) {
//			int result = x + y;
//			return result;
//		}
		
		
//			메서드이름(값1, 값2, ...); // 메서드의 호출
		
		
	}

}
